{"id":16,"title":"Create a Raspberry Pi Music Player with RuneAudio","summary":"In this post, I detail how to turn a Raspberry Pi into a music player using RuneAudio to stream your music collection over your local network. I'll also show how to control playback from a computer, or android phone or tablet. This post uses a raspberry pi 3, RuneAudio 0.4 (build: beta-20160313) and a windows 10 PC that contains the music collection.","body":"In this post, I detail how to turn a Raspberry Pi into a music player using <a target=\"_blank\" href=\"http://www.runeaudio.com/\">RuneAudio</a> to stream your music collection over your local network. I'll also show how to control playback from a computer, or android phone or tablet. This post uses a raspberry pi 3, RuneAudio 0.4 (build: beta-20160313) and a windows 10 PC that contains the music collection. First, we'll install RuneAudio on a micro sd card and configure it. Next, we'll share the local music folder on a windows 10 PC to make it available over the network. Finally, we'll configure RuneAudio to use the folder share as a source in its library.\r\n<br /><br />\r\n<h3>Install RuneAudio and Configure the Raspberry Pi</h3>\r\nDownload the RuneAudio image from <a target=\"_blank\" href=\"http://www.runeaudio.com/download/\">the RuneAudio download page.</a> The <a href=\"http://www.runeaudio.com/documentation/quick-start/sd-card-setup-windows/\" target=\"_blank\">RuneAudio docs</a> have a couple different examples of flashing the SD card in windows.\r\n<br /><br />\r\nOnce the SD card has RuneAudio on it, insert it into the Raspberry Pi and plug it in. RuneAudio is optimized for \"headless\" use or a 7\" touch screen, so if you connect a display to the Pi it probably won't look very good or be very useful. For first time use, plug the Pi into your router using an ethernet cable to get local network access. Then, navigate to <code>http://runeaudio/</code> from a browser on your computer or laptop. I couldn't get this to work on Android but there is a separate Android app I'll talk about later. You are now in RuneUI, which is a paltform independent UI that sits on top of RuneAudio. From here you can manage the library, playback, and settings. The <a href=\"http://www.runeaudio.com/documentation/runeui/runeui/\" target=\"_blank\">official Rune UI documentation is available here.</a>\r\n<br /><br />\r\nThe first thing we're going to do is configure wifi so the Pi doesn't have to be hard wired to the router. This is an optional step. Once in RuneUI, click on the Menu in the upper right and go to Network. You should see the LAN and wireless interfaces (WLAN). Click on the wireless WLAN interface and a list of available options appear. Select your wireless network and connect. Once connected you can unplug the Pi from the router. If you're using an earlier version of the Raspberry Pi, wifi might not be built in and wifi support requires a 3rd party adapter.\r\n<br />\r\n<img src=\"/data/blog/posts/img/create-a-raspberry-pi-music-player-with-runeaudio/network_interfaces.PNG\" style=\"width:75%;\" />\r\n<br /><br />\r\n<h3>Share the Music folder on a windows 10 PC</h3>\r\nOnce RuneAudio is configured on the Pi and you can connect to RuneUI from a browser, we're going to setup a folder share to mount as a source. If you already have the music available over your network you can skip this step and go to the next section which describes how to access the folder share from RuneAudio. It's also possible to use a local source like a USB hard drive plugged directly into the Pi. However, if you already have a large music collection on a PC, sharing the folder is a more robust solution.\r\n<br /><br />\r\nWe're going to share the folder in windows. This is no different from sharing any folder on a network. Right click on the folder you want to share and go to properties. Then select the <code>sharing</code> tab. Then click on <code>Advanced Sharing</code>. Check <code>Share this folder</code> and enter a share name. For basic sharing, that's it. Click OK, click OK again to close the properties.\r\n<img src=\"/data/blog/posts/img/create-a-raspberry-pi-music-player-with-runeaudio/sharing_properties.PNG\" style=\"width:33%; padding-right:5px;\" />\r\n<img src=\"/data/blog/posts/img/create-a-raspberry-pi-music-player-with-runeaudio/advanced_sharing.PNG\" style=\"width:33%;\" />\r\n<br /> <br />\r\nIt's a good idea to test the folder share before trying to connect it to the Pi. From another windows 10 PC or laptop, enter the UNC path into windows explorer to make sure the shared folder is accessible over the network. Use the IP address because that's what we need to configure the Pi to use. So the path is something like <code>\\\\&lt;ip_address&gt;\\Music</code>. If that works from another PC or laptop on the network, then the shared folder is working and you're ready to go to the next section where we tell the Pi to use it as a source.\r\n<br /><br />\r\n<h3>Configure RuneAudio to use the Shared Folder as a Library Source</h3>\r\nBack in RuneUI, click on the menu in the upper right and go to sources.\r\n<br />\r\n<img src=\"/data/blog/posts/img/create-a-raspberry-pi-music-player-with-runeaudio/runeui_menu.PNG\" style=\"width:33%;\" />\r\n<br /><br />\r\nClick on <code>ADD NEW MOUNT</code> under the <code>NETWORK MOUNTS</code> section.\r\n<br />\r\n<img src=\"/data/blog/posts/img/create-a-raspberry-pi-music-player-with-runeaudio/network_mounts.PNG\" style=\"width:100%;\" />\r\n<br /><br />\r\nThis is where it gets a little tricky. Each required setting is outlined in the table below\r\n<br /><br />\r\n<table class=\"table table-striped\">\r\n<thead>\r\n<tr>\r\n<th scope=\"col\">Setting Name</th>\r\n<th scope=\"col\">Setting Value</th>\r\n</tr>\r\n</thead>\r\n<tbody>\r\n<tr>\r\n<td>Source Name</td>\r\n<td>Name to identify this source in RuneUI</td>\r\n</tr>\r\n<tr>\r\n<td>Fileshare Protocol</td>\r\n<td>SMB/CIFS</td>\r\n</tr>\r\n<tr>\r\n<td>IP address</td>\r\n<td>The IP address of the windows 10 PC</td>\r\n</tr>\r\n<tr>\r\n<td>Remote Directory</td>\r\n<td>Name of the share assigned in windows.</td>\r\n</tr>\r\n<tr>\r\n<td>Guest access</td>\r\n<td>Dependent on the permissions setup on the folder share in windows. If default permissions were used, this needs to  be \"Off\" and a username and password of a user that has access to the folder in windows needs to be provided.</td>\r\n</tr>\r\n<tr>\r\n<td>Advanced options</td>\r\n<td>On</td>\r\n</tr>\r\n<tr>\r\n<td>Advanced options | Mount Flags</td>\r\n<td><ul><li>Remove <code>cache=</code> setting</li><li>Add <code>vers=3.0</code></li><li>The final mount flags should be<code>noserverino,ro,vers=3.0</code></li></ul></td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n<br />\r\nClick <code>SAVE MOUNT</code>. If everything went well, you are taken back to the Source screen and the entry is in the NETWORK MOUNTS section with a green checkmark. At this point, click on <code>REBUILD MPD LIBRARY</code> at the top of the page to build the library from the newly mounted source. This might take a while on the first run depending on the size of the library. I've found rebuilding after changes doesn't take as long.\r\n<br />\r\n<img src=\"/data/blog/posts/img/create-a-raspberry-pi-music-player-with-runeaudio/build_library.PNG\" style=\"width:100%;\" />\r\n<br /><br />\r\n<h3>Android App and Other Options</h3>\r\nA free app is available to control RuneAudio from an Android phone or tablet. It can be <a href=\"https://play.google.com/store/apps/details?id=com.runeaudio\" target=\"_blank\">downloaded from the Google Play store</a>. Once installed, it will detect RuneAudio running on the local network and connect to it. It works well for browsing the library and controlling playback.\r\n<br /><br />\r\nTo listen to audio from the Raspberry Pi, you need an external speaker. The Raspberry Pi 3 has a built in 3.5 mm audio jack built in that can be used with headphones or aux ports on external speakers. There are also a number of Raspberry Pi DAC \"hats\" that can be added to the Pi.\r\n<br /><br />\r\nIn conclusion, RuneAudio is an OS and web interface for playing music through the Raspberry Pi. It is headless so it can be put anywhere and connected to speakers. There are a few configuration steps to connect to a shared music source over the network. Playback can be controlled using a computer or laptop or with an Android phone or tablet through the app.","author":"Carl Layton","publishedDate":"2019-05-26T12:30:00Z","friendlyUri":"create-a-raspberry-pi-music-player-with-runeaudio","isPublished":true,"previousPostUri":"using-netlify-identity-widget-in-an-angular-application","previousPostTitle":"Using Netlify Identity Widget In An Angular Application","nextPostUri":null,"nextPostTitle":null,"tags":["Raspberry Pi"]}