{"id":7,"title":"Installing posh-git - A PowerShell Environment for Git","summary":"In this post, I detail the basic steps to install posh-git, a powershell module that integrates git into PowerShell. This makes it easier to work with git from any PowerShell session.","body":"<a target=\"_blank\" href=\"https://github.com/dahlbyk/posh-git\">posh-git</a> is a PowerShell module that integrates Git features directly in PowerShell. It includes inline status, color coded text, tab completion for common git commands and branch names, and more. It is a useful command line tool for working with Git on windows. The installation below assumes that you have <a target=\"_blank\" href=\"http://psget.net/\">PsGet</a> installed.\r\n<br /><br />\r\nOpen a new PowerShell session and run <code class=\"language-powershell\">Install-Module posh-git</code>. You might get a NuGet prompt for accepting packages, choose yes or \"Y\" for this. You also may get a prompt to trust installing packages from the the PowerShell gallery, choose Yes or \"Y\" for this too. Once it is installed, you can use it by running <code class=\"language-powershell\">Import-Module posh-git</code>. To see it work, navigate to a git repository in PowerShell. You should see something similar to this.\r\n<br /><br />\r\n<img src=\"/data/blog/posts/img/installing-posh-git-a-powershell-environment-for-git/annotatedPowerShell.png\" alt-text=\"PowerShell with posh-git\" width=\"75%\" height=\"75%\" />\r\n<br /><br />\r\nTo avoid having to enter <code class=\"language-powershell\">Import-Module posh-git</code> into every new PowerShell session, you can add it to the PowerShell settings to be loaded automatically. To add it to the current user, current PowerShell host settings execute the command <code class=\"language-powershell\">Add-PoshGitToProfile</code>. To see what it did run <code class=\"language-powershell\">notepad $profile.CurrentUserCurrentHost</code>. This will bring up Notepad with the configuration file. It should contain the line <code class=\"language-powershell\">Import-Module posh-git</code>.  This means anytime a new PowerShell session is opened, the module will be imported automatically so git integration will \"just work\".\r\n<br /><br />\r\nThat is it for getting posh-git installed and usable in PowerShell. The <a href=\"https://github.com/dahlbyk/posh-git\">readme on GitHub</a> explains how to add it across hosts and more configuration options for customizing the prompt.","author":"Carl Layton","publishedDate":"2018-04-27T12:15:00Z","friendlyUri":"installing-posh-git-a-powershell-environment-for-git","isPublished":true,"previousPostUri":"applying-the-strategy-pattern-to-vary-data-access-methods-in-csharp","previousPostTitle":"Applying The Strategy Pattern To Vary Data Access Methods In C#","nextPostUri":"setup-libgdx-project-in-android-studio","nextPostTitle":"Setup libGDX Project In Android Studio","tags":["Git","SCM","PowerShell"]}